twitsrv/app/controllers/static_controller.rb

SELECT * FROM `users` WHERE (`users`.`login` = 'noahsanto') LIMIT 1
SELECT * FROM `users` WHERE (remember_token = '68aca8715e28f8b1fa21' AND remember_token_expires_at > '2010-09-11 18:38:13') LIMIT 1
---
  def tweet
	if logged_in?
		# shorten url
		bitly = "http://api.bit.ly/v3/shorten?login=nsantorello&apiKey=R_1a8ae61512f06a04c8794075437890ed&longUrl="+params[:r]+"&format=json"
		bitly_response = Net::HTTP.get(URI.parse(bitly))
		short = JSON.parse(bitly_response)
		#if short['status_code'] == "200"


			# tweet
			user = User.find_by_login(current_user.login)

			user.twitter.get('/account/verify_credentials')

SELECT * FROM `users` ORDER BY created_at DESC LIMIT 16
---
  def pic
    @users = User.all(:order => "created_at DESC", :limit => 16)

SELECT * FROM `users` ORDER BY created_at DESC LIMIT 16
---
  def twitid
	@users = User.all(:order => "created_at DESC", :limit => 16)