shumarks/app/controllers/home_controller.rb

SELECT `users`.* FROM `users` INNER JOIN `read_receipts` ON `users`.id = `read_receipts`.user_id INNER JOIN `follows` ON `users`.id = `follows`.follower_id WHERE ((`follows`.followee_id = 1)) AND ((`read_receipts`.link_id = 80))
SELECT * FROM `links` WHERE (`links`.`user_id` IN (2,5,5,5)) ORDER BY created_at DESC
---
  def index
    if logged_in?
      following_user_ids = current_user.users.all(:select => 'follow_id').map(&:follow_id)

      @links = Link.all(:conditions => {:user_id => following_user_ids}, :order => 'created_at DESC')