shumarks/app/controllers/home_controller.rb

  def index
    @header_text = logged_in? ? "Most Recent" : "Shumarks"

    @most_recent = Link.most_recent(@pager)
    @page_total = (Link.count.to_f / @page_size.to_f).ceil
---
SELECT * FROM `links` ORDER BY created_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `links`