shumarks/app/controllers/links_controller.rb

SELECT * FROM `links` WHERE (`links`.`id` = '80') LIMIT 1
---
  def view
    if not @link = Link.find_by_id(params[:id])