shumarks/app/controllers/session_controller.rb

SELECT * FROM `users` WHERE (`users`.`login` = 'noah') LIMIT 1
---
  def create
    self.current_user = User.authenticate(params[:session][:login], params[:session][:password])
    if logged_in?
      if params[:remember_me] == "1"
        current_user.remember_me unless current_user.remember_token?
        cookies[:auth_token] = { :value => self.current_user.remember_token , :expires => self.current_user.remember_token_expires_at }
      end
      redirect_back_or_default('/')
      if !current_user.first_name and !current_user.last_name and ! current_user.bio