shumarks/app/controllers/users_controller.rb

  def set_user
    @user = current_user
    if @user
      @links = @user.links.all(:order => 'created_at DESC')
---
SELECT * FROM `links` WHERE (`links`.user_id = 1) ORDER BY created_at DESC