shumarks/app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (login LIKE '%asdf%' OR first_name LIKE '%asdf%' OR last_name LIKE '%asdf%')
---
  def search
    @search_term = params[:user_name].gsub('[^a-zA-Z0-9]', '')
    if !@search_term.blank?
      safe_term = "%#{@search_term}%"

      @users = User.all(:conditions =>
          ["login LIKE ? OR first_name LIKE ? OR last_name LIKE ?", safe_term, safe_term, safe_term])

INSERT INTO `twitter_auths` (`created_at`, `token`, `updated_at`, `secret`, `screen_name`) VALUES('2010-10-10 13:49:00', 'YtyL1PgW8IH62Q7Ok7SX03zM80dzjsnPJXpyITnnE', '2010-10-10 13:49:00', 'JS4xJLTRypnj4UM0LTtoktJ0Fg9b4EQFcY1c0pvZhSs', 'hello')
---
  def twitter_callback
    unless session[:request_token] && session[:request_token_secret] && session[:twitter_request_user]
      flash[:notice] = 'No authentication information was found in the session. Please try again.'
      redirect_to :action => :home
      return
    end

    unless params[:oauth_token].blank? || session[:request_token] ==  params[:oauth_token]
      flash[:notice] = 'Authentication information does not match session information. Please try again.'
      redirect_to :action => :home
      return
    end

    @request_token = OAuth::RequestToken.new(UsersController.twitter_consumer, session[:request_token], session[:request_token_secret])

    oauth_verifier = params["oauth_verifier"]
    @access_token = @request_token.get_access_token(:oauth_verifier => oauth_verifier)

    @twitteruser = TwitterAuth.new({ :screen_name => session[:twitter_request_user],:token => @access_token.token,:secret => @access_token.secret })
    @twitteruser.save!